notes/glad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GLAD</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="base/favicon" href="/base/favicon.png">
<link rel="stylesheet" href="https://www.haider.gq/base/style.css"/>
<link rel="stylesheet" href="https://www.haider.gq/base/table.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<header>
	  <a href='https://www.haider.gq' class='main_header'>Haider Mirza</a>
	  <nav>
	    <ul class='nav_links'>
	      <li><a href='https://www.haider.gq/about/about'>About</a></li>
	      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	      <li><a href='https://www.haider.gq/projects/projects'>Projects</a></li>
	      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	    </ul>
	  </nav>
	</header>
</div>
<div id="content" class="content">
<h1 class="title">GLAD</h1>

<div id="outline-container-org66b2357" class="outline-2">
<h2 id="org66b2357">GLAD</h2>
<div class="outline-text-2" id="text-org66b2357">
<p>
GLAD is extention loader Library to load OpenGL.
</p>
</div>
<div id="outline-container-org53b3e84" class="outline-3">
<h3 id="org53b3e84">Installation</h3>
<div class="outline-text-3" id="text-org53b3e84">
<p>
You actually have to generate the GLAD files using the following website: <a target='_blank' rel='noopener noreferrer' class='external' href="https://glad.dav1d.de/">glad.david.de</a>.
Yes, there is a <a href="guix.html#ID-4ce84157-a404-40fa-bdb8-0b3923916969">Guix</a> package aswell but at the moment I do not know how to use it.
</p>
</div>
</div>
<div id="outline-container-org21b8160" class="outline-3">
<h3 id="org21b8160">Get Working</h3>
<div class="outline-text-3" id="text-org21b8160">
<p>
Make sure you use Both this include and define.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">GLFW_INCLUDE_NONE</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;glad/gl.h&gt;</span>
</pre>
</div>
</div>
<div id="outline-container-org8bb1de9" class="outline-4">
<h4 id="org8bb1de9">NOTE</h4>
<div class="outline-text-4" id="text-org8bb1de9">
<p>
Be sure to include GLAD before GLFW.
The include file for GLAD includes the required OpenGL headers behind the scenes (like GL/gl.h) so be sure to include GLAD before other header files that require OpenGL (like GLFW). 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf54d414" class="outline-2">
<h2 id="orgf54d414">Links to this note</h2>
<div class="outline-text-2" id="text-orgf54d414">
<ul class="org-ul">
<li><a href="./c++.html">C++</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
	  <div class='footer-content'>
	    <h3>Haider Mirza</h3>
	    <p>Website created by Haider Mirza</p>
	    <ul class='socials'>
	      <li><a href='https://www.github.com/Haider-Mirza'><i class='fa fa-github'></i></a></li>
	      <li><a href='mailto:x7and7@gmail.com'><i class='fa fa-envelope'></i></a></li>
	    </ul>
	  </div>
	  <div class='footer-bottom'>
	    <p>Created by Haider Mirza with orgroam in emacs</p>
	  </div>
	</footer>
</div>
</body>
</html>
